OpenFOAM/airfoil/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    naca0018.stl
    {
        type triSurfaceMesh;
        name airfoil;
    }
    
    refinementBox
    {
        type searchableBox;
        min (-1.0 -1.5 0);
        max ( 4.0  1.5 0.1);
    }
    
    wakeRefinementBox
    {
        type searchableBox;
        min (0.5 -1.0 0);
        max (3.5  1.0 0.1);
    }
}

castellatedMeshControls
{
    maxLocalCells 500000;
    maxGlobalCells 1000000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (
    );

    refinementSurfaces
    {
        airfoil
        {
            level (1 2);
        }
    }

    resolveFeatureAngle 60;

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 1));
        }
        
        wakeRefinementBox
        {
            mode inside;
            levels ((1E15 1));
        }
    }

    locationInMesh (2.0 0 0.05);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 4.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        airfoil
        {
            nSurfaceLayers 2;
        }
    }

    expansionRatio 1.5;
    finalLayerThickness 0.5;
    minThickness 0.05;
    nGrow 0;
    featureAngle 80;
    slipFeatureAngle 30;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 2;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.01;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}

debug 0;

mergeTolerance 1e-6;

// ************************************************************************* //
